[
    {
        "name":"Smart Agriculture",
        "image": "images/agriculture.jpg",
        "description": "A IOT solution for managing agriculture field, remotely realtime view of field parameters and forecast depending on taken data. It measures field parameters like humidity, temperature, soil moisture, sun light intensity. Depending on these parameter, it controls the water pump. It has a website and android app to remotely view these parameters and control the pump manually also." ,
        "sourceCode": "https://github.com/ShanuDey/SmartAgricultureProject",
        "skills": "IOT, Android with Java, Web Development with PHP-HTML-CSS, Node MCU programming with C++, firebase as realtime database"
    },
    {
        "name": "Automatic Targeting System",
        "image": "images/ats.jpg",
        "description" : "A solution to capture live footage from camera and identify object using YOLO algorithm and target the object with NodeMCU controlled actuators.",
        "sourceCode":"https://github.com/ShanuDey/Automatic-Targetting-System",
        "skills":"Python, Computer Vision, YOLO, NodeMCU"
    },
    {
        "name" :"YT Remote",
        "image": "images/ytremote.jpg",
        "description": "A complete client and server solution to view Youtube videos in server which can be controller by client side UI. I have deployed it with my raspberry pi and monitor. The web application can be used to control server like changing video, search video, reboot and shutdown.",
        "sourceCode": "https://github.com/ShanuDey/YT-Remote",
        "skills": "Javascript, Puppeteer, ExpressJS, EJS, RaspberryPi, HTML, CSS"
    },
    {
        "name":"Equinox Kernel Manager",
        "image": "images/equinoxkm.jpg",
        "description":"A android kernel manager application to control and view android kernel parameters. It has some extra feature to install root applications, plotting graphs, create and save cpu scheduler profiles etc.",
        "sourceCode": "https://github.com/ShanuDey/EquinoxKernelManager",
        "skills": "Android, Java, Kernel, C"
    }
]